*> DATA-STRUCTURES.cbl
*> Contrato ejecutable y esqueletos de Node, LinkedList, Stack y Queue.

IDENTIFICATION DIVISION.
PROGRAM-ID. NODE-INIT.
DATA DIVISION.
LINKAGE SECTION.
COPY "DATA-STRUCTURES-PARAMS".
01 LN-VALUE              PIC S9(9).
PROCEDURE DIVISION USING DS-NODE LN-VALUE.
    GOBACK.
END PROGRAM NODE-INIT.

IDENTIFICATION DIVISION.
PROGRAM-ID. NODE-GET-VALUE.
DATA DIVISION.
LINKAGE SECTION.
COPY "DATA-STRUCTURES-PARAMS".
01 LN-RESULT             PIC S9(9).
PROCEDURE DIVISION USING DS-NODE LN-RESULT.
    MOVE 0 TO LN-RESULT
    GOBACK.
END PROGRAM NODE-GET-VALUE.

IDENTIFICATION DIVISION.
PROGRAM-ID. NODE-GET-NEXT.
DATA DIVISION.
LINKAGE SECTION.
COPY "DATA-STRUCTURES-PARAMS".
01 LN-NEXT               USAGE POINTER.
PROCEDURE DIVISION USING DS-NODE LN-NEXT.
    SET LN-NEXT TO NULL
    GOBACK.
END PROGRAM NODE-GET-NEXT.

IDENTIFICATION DIVISION.
PROGRAM-ID. NODE-SET-NEXT.
DATA DIVISION.
LINKAGE SECTION.
COPY "DATA-STRUCTURES-PARAMS".
01 LN-NEXT               USAGE POINTER.
PROCEDURE DIVISION USING DS-NODE LN-NEXT.
    GOBACK.
END PROGRAM NODE-SET-NEXT.

IDENTIFICATION DIVISION.
PROGRAM-ID. LINKED-LIST-INIT.
DATA DIVISION.
LINKAGE SECTION.
COPY "DATA-STRUCTURES-PARAMS".
PROCEDURE DIVISION USING DS-LINKED-LIST.
    GOBACK.
END PROGRAM LINKED-LIST-INIT.

IDENTIFICATION DIVISION.
PROGRAM-ID. LINKED-LIST-GET-HEAD.
DATA DIVISION.
LINKAGE SECTION.
COPY "DATA-STRUCTURES-PARAMS".
01 LN-RESULT             PIC S9(9).
PROCEDURE DIVISION USING DS-LINKED-LIST LN-RESULT.
    MOVE DS-FAILURE-VALUE TO LN-RESULT
    GOBACK.
END PROGRAM LINKED-LIST-GET-HEAD.

IDENTIFICATION DIVISION.
PROGRAM-ID. LINKED-LIST-INSERT-HEAD.
DATA DIVISION.
LINKAGE SECTION.
COPY "DATA-STRUCTURES-PARAMS".
01 LN-VALUE              PIC S9(9).
PROCEDURE DIVISION USING DS-LINKED-LIST LN-VALUE.
    GOBACK.
END PROGRAM LINKED-LIST-INSERT-HEAD.

IDENTIFICATION DIVISION.
PROGRAM-ID. LINKED-LIST-INSERT-TAIL.
DATA DIVISION.
LINKAGE SECTION.
COPY "DATA-STRUCTURES-PARAMS".
01 LN-VALUE              PIC S9(9).
PROCEDURE DIVISION USING DS-LINKED-LIST LN-VALUE.
    GOBACK.
END PROGRAM LINKED-LIST-INSERT-TAIL.

IDENTIFICATION DIVISION.
PROGRAM-ID. LINKED-LIST-DELETE.
DATA DIVISION.
LINKAGE SECTION.
COPY "DATA-STRUCTURES-PARAMS".
01 LN-VALUE              PIC S9(9).
01 LN-RESULT             PIC S9(9).
PROCEDURE DIVISION USING DS-LINKED-LIST LN-VALUE LN-RESULT.
    MOVE DS-FAILURE-VALUE TO LN-RESULT
    GOBACK.
END PROGRAM LINKED-LIST-DELETE.

IDENTIFICATION DIVISION.
PROGRAM-ID. LINKED-LIST-IS-EMPTY.
DATA DIVISION.
LINKAGE SECTION.
COPY "DATA-STRUCTURES-PARAMS".
01 LN-RESULT             PIC 9.
PROCEDURE DIVISION USING DS-LINKED-LIST LN-RESULT.
    MOVE 0 TO LN-RESULT
    GOBACK.
END PROGRAM LINKED-LIST-IS-EMPTY.

IDENTIFICATION DIVISION.
PROGRAM-ID. LINKED-LIST-SIZE.
DATA DIVISION.
LINKAGE SECTION.
COPY "DATA-STRUCTURES-PARAMS".
01 LN-RESULT             PIC 9(9).
PROCEDURE DIVISION USING DS-LINKED-LIST LN-RESULT.
    MOVE 0 TO LN-RESULT
    GOBACK.
END PROGRAM LINKED-LIST-SIZE.

IDENTIFICATION DIVISION.
PROGRAM-ID. STACK-INIT.
DATA DIVISION.
LINKAGE SECTION.
COPY "DATA-STRUCTURES-PARAMS".
PROCEDURE DIVISION USING DS-STACK.
    GOBACK.
END PROGRAM STACK-INIT.

IDENTIFICATION DIVISION.
PROGRAM-ID. STACK-PUSH.
DATA DIVISION.
LINKAGE SECTION.
COPY "DATA-STRUCTURES-PARAMS".
01 LN-VALUE              PIC S9(9).
PROCEDURE DIVISION USING DS-STACK LN-VALUE.
    GOBACK.
END PROGRAM STACK-PUSH.

IDENTIFICATION DIVISION.
PROGRAM-ID. STACK-POP.
DATA DIVISION.
LINKAGE SECTION.
COPY "DATA-STRUCTURES-PARAMS".
01 LN-RESULT             PIC S9(9).
PROCEDURE DIVISION USING DS-STACK LN-RESULT.
    MOVE DS-FAILURE-VALUE TO LN-RESULT
    GOBACK.
END PROGRAM STACK-POP.

IDENTIFICATION DIVISION.
PROGRAM-ID. STACK-PEEK.
DATA DIVISION.
LINKAGE SECTION.
COPY "DATA-STRUCTURES-PARAMS".
01 LN-RESULT             PIC S9(9).
PROCEDURE DIVISION USING DS-STACK LN-RESULT.
    MOVE DS-FAILURE-VALUE TO LN-RESULT
    GOBACK.
END PROGRAM STACK-PEEK.

IDENTIFICATION DIVISION.
PROGRAM-ID. STACK-IS-EMPTY.
DATA DIVISION.
LINKAGE SECTION.
COPY "DATA-STRUCTURES-PARAMS".
01 LN-RESULT             PIC 9.
PROCEDURE DIVISION USING DS-STACK LN-RESULT.
    MOVE 0 TO LN-RESULT
    GOBACK.
END PROGRAM STACK-IS-EMPTY.

IDENTIFICATION DIVISION.
PROGRAM-ID. STACK-SIZE.
DATA DIVISION.
LINKAGE SECTION.
COPY "DATA-STRUCTURES-PARAMS".
01 LN-RESULT             PIC 9(9).
PROCEDURE DIVISION USING DS-STACK LN-RESULT.
    MOVE 0 TO LN-RESULT
    GOBACK.
END PROGRAM STACK-SIZE.

IDENTIFICATION DIVISION.
PROGRAM-ID. QUEUE-INIT.
DATA DIVISION.
LINKAGE SECTION.
COPY "DATA-STRUCTURES-PARAMS".
PROCEDURE DIVISION USING DS-QUEUE.
    GOBACK.
END PROGRAM QUEUE-INIT.

IDENTIFICATION DIVISION.
PROGRAM-ID. QUEUE-ENQUEUE.
DATA DIVISION.
LINKAGE SECTION.
COPY "DATA-STRUCTURES-PARAMS".
01 LN-VALUE              PIC S9(9).
PROCEDURE DIVISION USING DS-QUEUE LN-VALUE.
    GOBACK.
END PROGRAM QUEUE-ENQUEUE.

IDENTIFICATION DIVISION.
PROGRAM-ID. QUEUE-DEQUEUE.
DATA DIVISION.
LINKAGE SECTION.
COPY "DATA-STRUCTURES-PARAMS".
01 LN-RESULT             PIC S9(9).
PROCEDURE DIVISION USING DS-QUEUE LN-RESULT.
    MOVE DS-FAILURE-VALUE TO LN-RESULT
    GOBACK.
END PROGRAM QUEUE-DEQUEUE.

IDENTIFICATION DIVISION.
PROGRAM-ID. QUEUE-PEEK.
DATA DIVISION.
LINKAGE SECTION.
COPY "DATA-STRUCTURES-PARAMS".
01 LN-RESULT             PIC S9(9).
PROCEDURE DIVISION USING DS-QUEUE LN-RESULT.
    MOVE -1 TO LN-RESULT
    GOBACK.
END PROGRAM QUEUE-PEEK.

IDENTIFICATION DIVISION.
PROGRAM-ID. QUEUE-IS-EMPTY.
DATA DIVISION.
LINKAGE SECTION.
COPY "DATA-STRUCTURES-PARAMS".
01 LN-RESULT             PIC 9.
PROCEDURE DIVISION USING DS-QUEUE LN-RESULT.
    MOVE 0 TO LN-RESULT
    GOBACK.
END PROGRAM QUEUE-IS-EMPTY.

IDENTIFICATION DIVISION.
PROGRAM-ID. QUEUE-SIZE.
DATA DIVISION.
LINKAGE SECTION.
COPY "DATA-STRUCTURES-PARAMS".
01 LN-RESULT             PIC 9(9).
PROCEDURE DIVISION USING DS-QUEUE LN-RESULT.
    MOVE 0 TO LN-RESULT
    GOBACK.
END PROGRAM QUEUE-SIZE.
