*> DATA-STRUCTURES.cbl
*> Contrato ejecutable y esqueletos de Node, LinkedList, Stack y Queue.

IDENTIFICATION DIVISION.
PROGRAM-ID. NODE-INIT.
DATA DIVISION.
LINKAGE SECTION.
COPY "DATA-STRUCTURES-PARAMS".
01 LN-VALUE              PIC S9(9).
PROCEDURE DIVISION USING DS-NODE LN-VALUE.
    MOVE LN-VALUE TO DS-NODE-VALUE.
    SET DS-NODE-NEXT TO NULL.
    GOBACK.
END PROGRAM NODE-INIT.

IDENTIFICATION DIVISION.
PROGRAM-ID. NODE-GET-VALUE.
DATA DIVISION.
LINKAGE SECTION.
COPY "DATA-STRUCTURES-PARAMS".
01 LN-RESULT             PIC S9(9).
PROCEDURE DIVISION USING DS-NODE LN-RESULT.
    MOVE DS-NODE-VALUE TO LN-RESULT.
    GOBACK.
END PROGRAM NODE-GET-VALUE.

IDENTIFICATION DIVISION.
PROGRAM-ID. NODE-GET-NEXT.
DATA DIVISION.
LINKAGE SECTION.
COPY "DATA-STRUCTURES-PARAMS".
01 LN-NEXT               USAGE IS POINTER.
PROCEDURE DIVISION USING DS-NODE LN-NEXT.
    SET LN-NEXT TO DS-NODE-NEXT.
    GOBACK.
END PROGRAM NODE-GET-NEXT.

IDENTIFICATION DIVISION.
PROGRAM-ID. NODE-SET-NEXT.
DATA DIVISION.
LINKAGE SECTION.
COPY "DATA-STRUCTURES-PARAMS".
01 LN-NEXT               USAGE POINTER.
PROCEDURE DIVISION USING DS-NODE LN-NEXT.
    SET DS-NODE-NEXT TO LN-NEXT.
    GOBACK.
END PROGRAM NODE-SET-NEXT.

IDENTIFICATION DIVISION.
PROGRAM-ID. LINKED-LIST-INIT.
DATA DIVISION.
LINKAGE SECTION.
COPY "DATA-STRUCTURES-PARAMS".
PROCEDURE DIVISION USING DS-LINKED-LIST.
    SET DS-LIST-HEAD TO NULL.
    SET DS-LIST-TAIL TO NULL.
    SET DS-LIST-COUNT TO 0.
    GOBACK.
END PROGRAM LINKED-LIST-INIT.

IDENTIFICATION DIVISION.
PROGRAM-ID. LINKED-LIST-GET-HEAD.
DATA DIVISION.
LINKAGE SECTION.
COPY "DATA-STRUCTURES-PARAMS".
01 LN-RESULT             PIC S9(9).
PROCEDURE DIVISION USING DS-LINKED-LIST LN-RESULT.
    IF DS-LIST-HEAD IS NULL
        MOVE DS-FAILURE-VALUE TO LN-RESULT
    ELSE
        MOVE DS-LIST-HEAD-VALUE TO LN-RESULT
    END-IF.
    GOBACK.
END PROGRAM LINKED-LIST-GET-HEAD.

IDENTIFICATION DIVISION.
PROGRAM-ID. LINKED-LIST-INSERT-HEAD.
DATA DIVISION.
LINKAGE SECTION.
COPY "DATA-STRUCTURES-PARAMS".
01 LN-VALUE              PIC S9(9).
PROCEDURE DIVISION USING DS-LINKED-LIST LN-VALUE.
    MOVE LN-VALUE TO DS-TEMP-NODE-VALUE.
    SET DS-TEMP-NODE-NEXT TO DS-LIST-HEAD.
    SET DS-LIST-HEAD TO DS-TEMP-NODE.
    IF DS-LIST-TAIL IS NULL
        SET DS-LIST-TAIL TO DS-TEMP-NODE
    END-IF.
    ADD 1 TO DS-LIST-COUNT.
    GOBACK.
END PROGRAM LINKED-LIST-INSERT-HEAD.

IDENTIFICATION DIVISION.
PROGRAM-ID. LINKED-LIST-INSERT-TAIL.
DATA DIVISION.
LINKAGE SECTION.
COPY "DATA-STRUCTURES-PARAMS".
01 LN-VALUE              PIC S9(9).
PROCEDURE DIVISION USING DS-LINKED-LIST LN-VALUE.
    MOVE LN-VALUE TO DS-TEMP-NODE-VALUE.
    SET DS-TEMP-NODE-NEXT TO NULL.
    IF DS-LIST-TAIL IS NULL
        SET DS-LIST-HEAD TO DS-TEMP-NODE
        SET DS-LIST-TAIL TO DS-TEMP-NODE
    ELSE
        SET DS-LIST-TAIL-NEXT TO DS-TEMP-NODE
        SET DS-LIST-TAIL TO DS-TEMP-NODE
    END-IF.
    ADD 1 TO DS-LIST-COUNT.
    GOBACK.
END PROGRAM LINKED-LIST-INSERT-TAIL.

IDENTIFICATION DIVISION.
PROGRAM-ID. LINKED-LIST-DELETE.
DATA DIVISION.
LINKAGE SECTION.
COPY "DATA-STRUCTURES-PARAMS".
01 LN-VALUE              PIC S9(9).
01 LN-RESULT             PIC S9(9).
PROCEDURE DIVISION USING DS-LINKED-LIST LN-VALUE LN-RESULT.
    IF DS-LIST-HEAD IS NULL
        MOVE DS-FAILURE-VALUE TO LN-RESULT
    ELSE
        WHILE DS-LIST-HEAD IS NOT NULL
            IF DS-LIST-HEAD-VALUE = LN-VALUE
                SET DS-LIST-HEAD TO DS-LIST-HEAD-NEXT
                SUBTRACT 1 FROM DS-LIST-COUNT
                MOVE LN-VALUE TO LN-RESULT
                EXIT PERFORM
            ELSE
                SET DS-LIST-HEAD TO DS-LIST-HEAD-NEXT
            END-IF
        END-WHILE
    END-IF.
    GOBACK.
END PROGRAM LINKED-LIST-DELETE.

IDENTIFICATION DIVISION.
PROGRAM-ID. LINKED-LIST-IS-EMPTY.
DATA DIVISION.
LINKAGE SECTION.
COPY "DATA-STRUCTURES-PARAMS".
01 LN-RESULT             PIC 9.
PROCEDURE DIVISION USING DS-LINKED-LIST LN-RESULT.
    IF DS-LIST-HEAD IS NULL
        MOVE 1 TO LN-RESULT
    ELSE
        MOVE 0 TO LN-RESULT
    END-IF.
    GOBACK.
END PROGRAM LINKED-LIST-IS-EMPTY.

IDENTIFICATION DIVISION.
PROGRAM-ID. LINKED-LIST-SIZE.
DATA DIVISION.
LINKAGE SECTION.
COPY "DATA-STRUCTURES-PARAMS".
01 LN-RESULT             PIC 9(9).
PROCEDURE DIVISION USING DS-LINKED-LIST LN-RESULT.
    MOVE DS-LIST-COUNT TO LN-RESULT.
    GOBACK.
END PROGRAM LINKED-LIST-SIZE.

IDENTIFICATION DIVISION.
PROGRAM-ID. STACK-INIT.
DATA DIVISION.
LINKAGE SECTION.
COPY "DATA-STRUCTURES-PARAMS".
PROCEDURE DIVISION USING DS-STACK.
    SET DS-STACK-TOP TO NULL
    MOVE 0 TO DS-STACK-COUNT.
    GOBACK.
END PROGRAM STACK-INIT.

IDENTIFICATION DIVISION.
PROGRAM-ID. STACK-PUSH.
DATA DIVISION.
LINKAGE SECTION.
COPY "DATA-STRUCTURES-PARAMS".
01 LN-VALUE              PIC S9(9).
PROCEDURE DIVISION USING DS-STACK LN-VALUE.
    SET DS-TEMP-NODE TO NULL
    MOVE LN-VALUE TO DS-TEMP-NODE-VALUE
    SET DS-TEMP-NODE-NEXT TO DS-STACK-TOP
    SET DS-STACK-TOP TO DS-TEMP-NODE
    ADD 1 TO DS-STACK-COUNT
    GOBACK.
END PROGRAM STACK-PUSH.

IDENTIFICATION DIVISION.
PROGRAM-ID. STACK-POP.
DATA DIVISION.
LINKAGE SECTION.
COPY "DATA-STRUCTURES-PARAMS".
01 LN-RESULT             PIC S9(9).
PROCEDURE DIVISION USING DS-STACK LN-RESULT.
    IF DS-STACK-TOP IS NULL
        MOVE DS-FAILURE-VALUE TO LN-RESULT
    ELSE
        MOVE DS-STACK-TOP-VALUE TO LN-RESULT
        SET DS-STACK-TOP TO DS-STACK-TOP-NEXT
        SUBTRACT 1 FROM DS-STACK-COUNT
    END-IF.
    GOBACK.
END PROGRAM STACK-POP.

IDENTIFICATION DIVISION.
PROGRAM-ID. STACK-PEEK.
DATA DIVISION.
LINKAGE SECTION.
COPY "DATA-STRUCTURES-PARAMS".
01 LN-RESULT             PIC S9(9).
PROCEDURE DIVISION USING DS-STACK LN-RESULT.
    IF DS-STACK-TOP IS NULL
        MOVE DS-FAILURE-VALUE TO LN-RESULT
    ELSE
        MOVE DS-STACK-TOP-VALUE TO LN-RESULT
    END-IF.
    GOBACK.
END PROGRAM STACK-PEEK.

IDENTIFICATION DIVISION.
PROGRAM-ID. STACK-IS-EMPTY.
DATA DIVISION.
LINKAGE SECTION.
COPY "DATA-STRUCTURES-PARAMS".
01 LN-RESULT             PIC 9.
PROCEDURE DIVISION USING DS-STACK LN-RESULT.
    IF DS-STACK-TOP IS NULL
        MOVE 1 TO LN-RESULT
    ELSE
        MOVE 0 TO LN-RESULT
    END-IF.
    GOBACK.
END PROGRAM STACK-IS-EMPTY.

IDENTIFICATION DIVISION.
PROGRAM-ID. STACK-SIZE.
DATA DIVISION.
LINKAGE SECTION.
COPY "DATA-STRUCTURES-PARAMS".
01 LN-RESULT             PIC 9(9).
PROCEDURE DIVISION USING DS-STACK LN-RESULT.
    MOVE DS-STACK-COUNT TO LN-RESULT.
    GOBACK.
END PROGRAM STACK-SIZE.

IDENTIFICATION DIVISION.
PROGRAM-ID. QUEUE-INIT.
DATA DIVISION.
LINKAGE SECTION.
COPY "DATA-STRUCTURES-PARAMS".
PROCEDURE DIVISION USING DS-QUEUE.
    SET DS-QUEUE-FRONT TO NULL
    SET DS-QUEUE-REAR TO NULL
    MOVE 0 TO DS-QUEUE-COUNT.
    GOBACK.
END PROGRAM QUEUE-INIT.

IDENTIFICATION DIVISION.
PROGRAM-ID. QUEUE-ENQUEUE.
DATA DIVISION.
LINKAGE SECTION.
COPY "DATA-STRUCTURES-PARAMS".
01 LN-VALUE              PIC S9(9).
PROCEDURE DIVISION USING DS-QUEUE LN-VALUE.
    SET DS-TEMP-NODE TO NULL
    MOVE LN-VALUE TO DS-TEMP-NODE-VALUE
    SET DS-TEMP-NODE-NEXT TO NULL
    IF DS-QUEUE-REAR IS NULL
        SET DS-QUEUE-FRONT TO DS-TEMP-NODE
        SET DS-QUEUE-REAR TO DS-TEMP-NODE
    ELSE
        SET DS-QUEUE-REAR-NEXT TO DS-TEMP-NODE
        SET DS-QUEUE-REAR TO DS-TEMP-NODE
    END-IF
    ADD 1 TO DS-QUEUE-COUNT
    GOBACK.
END PROGRAM QUEUE-ENQUEUE.

IDENTIFICATION DIVISION.
PROGRAM-ID. QUEUE-DEQUEUE.
DATA DIVISION.
LINKAGE SECTION.
COPY "DATA-STRUCTURES-PARAMS".
01 LN-RESULT             PIC S9(9).
PROCEDURE DIVISION USING DS-QUEUE LN-RESULT.
    MOVE DS-FAILURE-VALUE TO LN-RESULT.
    GOBACK.
END PROGRAM QUEUE-DEQUEUE.

IDENTIFICATION DIVISION.
PROGRAM-ID. QUEUE-PEEK.
DATA DIVISION.
LINKAGE SECTION.
COPY "DATA-STRUCTURES-PARAMS".
01 LN-RESULT             PIC S9(9).
PROCEDURE DIVISION USING DS-QUEUE LN-RESULT.
    MOVE -1 TO LN-RESULT.
    GOBACK.
END PROGRAM QUEUE-PEEK.

IDENTIFICATION DIVISION.
PROGRAM-ID. QUEUE-IS-EMPTY.
DATA DIVISION.
LINKAGE SECTION.
COPY "DATA-STRUCTURES-PARAMS".
01 LN-RESULT             PIC 9.
PROCEDURE DIVISION USING DS-QUEUE LN-RESULT.
    MOVE 0 TO LN-RESULT.
    GOBACK.
END PROGRAM QUEUE-IS-EMPTY.

IDENTIFICATION DIVISION.
PROGRAM-ID. QUEUE-SIZE.
DATA DIVISION.
LINKAGE SECTION.
COPY "DATA-STRUCTURES-PARAMS".
01 LN-RESULT             PIC 9(9).
PROCEDURE DIVISION USING DS-QUEUE LN-RESULT.
    MOVE 0 TO LN-RESULT.
    GOBACK.
END PROGRAM QUEUE-SIZE.
