COPYBOOK ASSERTS.

WORKING-STORAGE SECTION.
01 WS-ASSERT-REGISTRO.
05 WS-ASSERT-TOTAL    PIC 9(03) VALUE 0.
05 WS-ASSERT-PASADOS  PIC 9(03) VALUE 0.
05 WS-ASSERT-FALLADOS PIC 9(03) VALUE 0.

PROCEDURE DIVISION USING WS-ASSERT-REGISTRO.

ASSERT-EQUAL.
    ADD 1 TO WS-ASSERT-TOTAL.
    IF WS-ASSERT-ESPERADO = WS-ASSERT-ACTUAL
        ADD 1 TO WS-ASSERT-PASADOS
    ELSE
        ADD 1 TO WS-ASSERT-FALLADOS
        DISPLAY "ERROR: Se esperaba '" WS-ASSERT-ESPERADO
            "', pero se obtuvo '" WS-ASSERT-ACTUAL "'"
        END-IF.
    EXIT.
