*> NUMBERS-PARAMS.cpy
*> Variables compartidas para pruebas de NUMBERS.
*> Tipos usados por todos los subprogramas.

01 NUM-N         PIC S9(9).
01 NUM-A         PIC S9(9).
01 NUM-B         PIC S9(9).
01 NUM-RESULT    PIC S9(9).
01 NUM-EXPECTED  PIC S9(9).
01 NUM-NAME      PIC X(40).
01 NUM-RES-ACC1  PIC S9(9).
01 NUM-RES-ACC2  PIC S9(9).